// Напишите программу которая на вход принимает число и выдает его квадрат


//Console.Write("Введи целое число: ");

//int namber = int.Parse(Console.ReadLine());

// Квадрат входного числа
//int result = namber * namber;

// Вывод результата
//Console.WriteLine($"Квадрат входного числа: {result}");
//---------------------------------------------------------------------------------------------------